Revit 2027 API
ExternalDataManagerDataItem(ExternalDataManagerDataItemId) Constructor
 Constructor
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerDataItem(
	ExternalDataManagerDataItemId id
)
Public Sub New (
	id As ExternalDataManagerDataItemId
)
public:
ExternalDataManagerDataItem(
	ExternalDataManagerDataItemId^ id
)
new :
        id : ExternalDataManagerDataItemId -> ExternalDataManagerDataItem
Parameters
id ExternalDataManagerDataItemId
 The id of the data item.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
ExternalDataManagerDataItem Overload
Autodesk.Revit.UI Namespace